# Introdução
Este notebook servirá para aferir os conhecimentos adquiridos.
Para esse efeito, ao invés de carregarmos e tratarmos um dataset lido a partir de um ficheiro, iremos criá-lo com recurso ao próprio PANDAS.

## Criação do dataset...
...a partir de um "dicionário" em Python

In [1]:
import pandas as pd
df = pd.DataFrame(data = {
    "Marcos": [9, 11, 8, 9, 6, 12, 8],
    "João": [12, 13, 10, 15, 12, 13, 14],
    "Margarida": [10, 11, 13, 15, 16, 17, 13],
    "Soraia": [15, 16, 18, 19, 16, 14, 14],
    "Bernardo": [16, 16, 17, 17, 15, 14, 18],
    "Joaquim": [13, 11, 12, 10, 10, 8, 12],
    "Isaura": [19, 18, 18, 19, 17, 18, 18],
    "Sara": [11, 12, 9, 13, 14, 11, 8],
    "Pedro": [15, 12, 13, 12, 11, 11, 13],
    "Mauro": [11, 12, 9, 8, 8, 14, 11],},
    index = ['Matemática', 'Português', 'Inglês', 'Geografia', 'História', 'Física', 'Biologia'])
df

,Marcos,João,Margarida,Soraia,Bernardo,Joaquim,Isaura,Sara,Pedro,Mauro
Matemática,9,12,10,15,16,13,19,11,15,11
Português,11,13,11,16,16,11,18,12,12,12
Inglês,8,10,13,18,17,12,18,9,13,9
Geografia,9,15,15,19,17,10,19,13,12,8
História,6,12,16,16,15,10,17,14,11,8
Física,12,13,17,14,14,8,18,11,11,14
Biologia,8,14,13,14,18,12,18,8,13,11

# **Questões**

## 1 - Obtenha uma visualização sumária dos primeiros 2 registos

In [2]:
df.head(2)

,Marcos,João,Margarida,Soraia,Bernardo,Joaquim,Isaura,Sara,Pedro,Mauro
Matemática,9,12,10,15,16,13,19,11,15,11
Português,11,13,11,16,16,11,18,12,12,12

## 2 - Obtenha uma visualização sumária dos úlitmos 3 registos

In [3]:
df.tail(3)

,Marcos,João,Margarida,Soraia,Bernardo,Joaquim,Isaura,Sara,Pedro,Mauro
História,6,12,16,16,15,10,17,14,11,8
Física,12,13,17,14,14,8,18,11,11,14
Biologia,8,14,13,14,18,12,18,8,13,11

## 3 - Escreva o código que permite obter informação APENAS sobre o número de linhas e colunas do nosso dataframe.

In [4]:
df.shape

(7, 10)

## 4 - Escreva o código que lhe permite obter informação mais detalhada sobre a estrutura e conteúdos do dataframe em questão.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Matemática to Biologia
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Marcos     7 non-null      int64
 1   João       7 non-null      int64
 2   Margarida  7 non-null      int64
 3   Soraia     7 non-null      int64
 4   Bernardo   7 non-null      int64
 5   Joaquim    7 non-null      int64
 6   Isaura     7 non-null      int64
 7   Sara       7 non-null      int64
 8   Pedro      7 non-null      int64
 9   Mauro      7 non-null      int64
dtypes: int64(10)
memory usage: 616.0+ bytes

## 5 - Ainda falando de estrutura/conteúdos do dataframe (pergunta anterior), descreva por palavras suas a informação que consta da resposta anterior.

Resposta: Trata-se de uma pauta de notas escolar em forma de uma tabela em que constam as classificações de diversas disciplinas que foram atribuidas a 10 alunos. Constam informações relativas ao numero de colunas (10) e respetivamente, o primeiro e último nomes dessas colunas. É também possivel constatar o número de valores nulos para cada uma das colunas (o qual nesta situação é zero, nao existem valores nulos). É possivel verificar que o tipo de dados de todas as colunas é 'inteiro', ou seja tratam-se se variáveis númericas.

## 6 - Que função usaria para conhecer com mais algum detalhe a informação descritiva (e agregada) dos dados numéricos no nosso dataframe? (escreva o respetivo código)

In [6]:
df.describe()

,Marcos,João,Margarida,Soraia,Bernardo,Joaquim,Isaura,Sara,Pedro,Mauro
count,7.0,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000
mean,9.0,12.714286,13.571429,16.000000,16.142857,10.857143,18.142857,11.142857,12.428571,10.428571
std,2.0,1.603567,2.572751,1.914854,1.345185,1.676163,0.690066,2.115701,1.397276,2.225395
min,6.0,10.000000,10.000000,14.000000,14.000000,8.000000,17.000000,8.000000,11.000000,8.000000
25%,8.0,12.000000,12.000000,14.500000,15.500000,10.000000,18.000000,10.000000,11.500000,8.500000
50%,9.0,13.000000,13.000000,16.000000,16.000000,11.000000,18.000000,11.000000,12.000000,11.000000
75%,10.0,13.500000,15.500000,17.000000,17.000000,12.000000,18.500000,12.500000,13.000000,11.500000
max,12.0,15.000000,17.000000,19.000000,18.000000,13.000000,19.000000,14.000000,15.000000,14.000000

## 7 - Em relação ao resultado obtido na pergunta anterior, explique por palavras suas o significado de cada uma das agregações (primeira coluna).

Resposta: Count: contagem do numero de observações ou linhas que neste caso são as notas de cada uma das disciplinas;
mean: é a media total das classificações;
std: refere-se ao desvio padrao da média;
min e max: é, respetivamente, o valor minimo e máximo observados no conjunto das entradas da coluna 'Marcus', que neste caso representa a nota mais baixa e a nota mais alta;
25%, 50%, 75%: refere-se ao 1º, 2º e 3º quadrantes. Representam a disribuição das diferentes notas. Por exemplo 25% das notas são iguais ou menores que 8.

## 8 - Isole a coluna (ou série) "Isaura" e guarde a sua referência numa variável c/ um nome à sua escolha.

In [7]:
df_isaura= df['Isaura']
df_isaura

Matemática    19
Português     18
Inglês        18
Geografia     19
História      17
Física        18
Biologia      18
Name: Isaura, dtype: int64

## 9 - Usando a variável que criou na pergunta anterior, e os seus conhecimentos sobre como obter informações descritivas de dados numéricos, qual o valor do **desvio-padrão** das respetivas classificações? (escreva o código na célula seguinte e a resposta na outra seguinte)

In [8]:
df_isaura.std()

0.6900655593423541

## 10 - Explique por palavras suas o significado daquele desvio-padrão (pergunta anterior) em relação aos dados que constam naquela coluna em análise.

Resposta: Neste caso, o desvio-padrão é de aproximadamente 0.69, o desvio-padrão é baixo, o que sugere que as classificações de Isaura estão relativamente próximas da sua média.

## 11 - A célula seguinte tem o código que permite fazer uma TRANSPOSIÇÃO de uma dataframe... Ou seja, orientar o dataframe de forma a que as linhas passem a ser colunas e as colunas passem a ser as linhas. Analise o resultado...

In [9]:
df2 = df.transpose()
df2 # não mexemos no 'df' original; obtivemos uma cópia da transposição sob a variável 'df2'...

,Matemática,Português,Inglês,Geografia,História,Física,Biologia
Marcos,9,11,8,9,6,12,8
João,12,13,10,15,12,13,14
Margarida,10,11,13,15,16,17,13
Soraia,15,16,18,19,16,14,14
Bernardo,16,16,17,17,15,14,18
Joaquim,13,11,12,10,10,8,12
Isaura,19,18,18,19,17,18,18
Sara,11,12,9,13,14,11,8
Pedro,15,12,13,12,11,11,13
Mauro,11,12,9,8,8,14,11

Resposta: O resultado será um novo dataframe onde os rótulos das disciplinas são agora as colunas e os nomes dos alunos os índices das respetivas linhas. Isto pode ser útil em situações em que se deseja analisar os dados de uma perspectiva diferente. A forma de como se analisam os resultados depende do contexto e dos objetivos da análise.

## 12 - Usando o dataframe transposto 'df2' - *daqui em diante, será este que iremos usar até ao final do questionário* - execute a instrução que permite obter uma tabela de correlações entre as disciplinas.

In [10]:
df2.corr()

,Matemática,Português,Inglês,Geografia,História,Física,Biologia
Matemática,1.000000,0.859374,0.852137,0.677623,0.581649,0.302003,0.831063
Português,0.859374,1.000000,0.832289,0.824576,0.661290,0.562401,0.792666
Inglês,0.852137,0.832289,1.000000,0.840092,0.768069,0.480014,0.847401
Geografia,0.677623,0.824576,0.840092,1.000000,0.913471,0.596137,0.744018
História,0.581649,0.661290,0.768069,0.913471,1.000000,0.579908,0.645777
Física,0.302003,0.562401,0.480014,0.596137,0.579908,1.000000,0.540189
Biologia,0.831063,0.792666,0.847401,0.744018,0.645777,0.540189,1.000000

## 13 - Observe detalhadamente a tabela anterior e, usando as suas capacidades de análise, interpretação e palavras suas, escreva algumas conclusões que pode antecipar, desta fase exploratória.

Resposta: Todas as disciplinas tem correlações positivas entre si. Existem umas correlações mais fortes do que outras. Por exemplo a correlação entre Historia e Geografia sugere que se um aluno sobe a classificação a Historia é muito provavel que tenha um resultado semelhante a Geografia, já o mesmo nao se verifica entre Física e qualquer uma das restantes disciplinas.

## 14 - Escreva o código que permite visualizar apenas as colunas de Matemática e Português, e apenas os últimos 3 registos. Se possível, use apenas uma linha de código única... Se não se lembrar, recorra ao apoio de uma variável.

In [11]:
df2[['Matemática', 'Português']].tail(3)

       Matemática  Português
Sara           11         12
Pedro          15         12
Mauro          11         12

## 15 - Isole o registo correspondente ao aluno Bernardo... e apresente-o como resultado,

In [12]:
df_bernardo=df2.loc['Bernardo']
df_bernardo

Matemática    16
Português     16
Inglês        17
Geografia     17
História      15
Física        14
Biologia      18
Name: Bernardo, dtype: int64

## 16 - Usando o resultado anterior (terá sido prudente se usou uma variável 😉), obtenha uma informação descritiva/estatística sobre as classificações do Bernardo.

In [13]:
df_bernardo.describe()

count     7.000000
mean     16.142857
std       1.345185
min      14.000000
25%      15.500000
50%      16.000000
75%      17.000000
max      18.000000
Name: Bernardo, dtype: float64

## 17 - Use uma linha de instrução única para selecionar os alunos que tiveram uma classificação superior ou igual a 15 em Matemática.

In [18]:
df2[df2['Matemática']>=15]['Matemática']

Soraia      15
Bernardo    16
Isaura      19
Pedro       15
Name: Matemática, dtype: int64

## 18 - Usando o princípio semelhante ao da pergunta anterior, use o código Python necessário para apresentar todos os alunos que tiveram classificação superior à média na disciplina de Português.

In [21]:
print('media a portuges: ', df2['Português'].mean())
df3= df2[df2['Português']>=df2['Português'].mean()]
df3['Português']

media a portuges:  13.2

Soraia      16
Bernardo    16
Isaura      18
Name: Português, dtype: int64

## 19 - Analise o código Python seguinte, e corrija os erros que o impedem de executar normalmente. O objetivo é obter o resultado da sua execução.

In [49]:
def on_off(lst):
    if len([x for x in lst if x < 10]) >= 2:
        return 'OFF'
    else:
        return 'ON'

df.apply(on_off)  # forma de aplicar uma função definida por nós a todos os registos/linhas do nosso dataframe

Marcos       OFF
João          ON
Margarida     ON
Soraia        ON
Bernardo      ON
Joaquim       ON
Isaura        ON
Sara         OFF
Pedro         ON
Mauro        OFF
dtype: object

## 20 - Agora que conseguiu executar o código anterior, e já conseguiu ver o respetivo resultado, procure explicar o resultado obtido, observando e seguindo o código Python que lhe deu origem.

Resposta:

O resultado indica os alunos que reprovaram de ano ('OFF') e os que não reprovaram de ano ('ON'). A função determina que os alunos que tiveram classificação menor do que 10 a pelo menos duas disciplinas tem atribuida a designação 'OFF', que significa que o aluno reprovou. Quando o contrario acontece, o aluno fica com a designação 'ON', que significa que o aluno transitou.